{"Identifier":"form_CLM","ContractType":"CLM","Description":"General description of CLM","Version":"20181206","Terms":[{"Group":"Calendar","Name":"Calendar","Type":"List","List":"some list","Description":"Calendar defines the non-working days which affect the dates of contract events (CDE's) in combination with EOMC and BDC.","Applicability":"x"},{"Group":"Calendar","Name":"BusinessDayConvention","Type":"List","List":"some list","Description":"BDC's are linked to a calendar. Calendars have working and non-working days. A BDC value other than N means that cash flows cannot fall on non-working days, they must be shifted to the next business day (following) or the previous on (preceding).\nThese two simple rules get refined twofold:\n- Following modified (preceding): Same like following (preceding), however if a cash flow gets shifted into a new month, then  it is shifted to preceding (following) business day.\n- Shift/calculate (SC) and calculate/shift (CS). Accrual, principal, and possibly other calculations are affected by this choice. In the case of SC first the dates are shifted and after the shift cash flows are calculated. In the case of CS it is the other way round.\nAttention: Does not affect non-cyclical dates such as PRD, MD, TD, IPCED since they can be set to the correct date directly.","Applicability":"x"},{"Group":"Calendar","Name":"EndOfMonthConvention","Type":"List","List":"some list","Description":"When computing schedules a special problem arises if an anchor date is at the end of a month and a cycle of monthly or quarterly is applied (yearly in the case of leap years only). How do we have to interpret an anchor date April 30 plus 1M cycles? In case where EOM is selected, it will jump to the 31st of May, then June 30, July 31 and so on. If SM is selected, it will jump to the 30st always with of course an exception in February. \nThis logic applies for all months having 30 or less days and an anchor date at the last day. Month with 31 days will at any rate jump to the last of the month if anchor date is on the last day.","Applicability":"x"},{"Group":"Contract identification","Name":"ContractType","Type":"List","List":"some list","Description":"The ContractType is the most important information. It defines the cash flow generating pattern of a contract. The ContractType information in combination with a given state of the risk factors will produce a deterministic sequence of cash flows which are the basis of any financial analysis.","Applicability":"NN"},{"Group":"Contract identification","Name":"StatusDate","Type":"x","List":"some list","Description":"SD holds the date per which all attributes of the record were updated. This is especially important for the highly dynamic attributes like Accruals, Notional, interest rates in variable instruments etc.","Applicability":"NN(,,1)"},{"Group":"Contract identification","Name":"ContractRole","Type":"List","List":"some list","Description":"CNTRL defines which position the LEIRC ( the creator of the contract record ) takes in a contract. For example, whether the contract is an asset or liability, a long or short position for the LEIRC. \nMost contracts are simple on or off balance sheet positions which are assets, liabilities. Such contracts can also play a secondary role as a collateral. \nThe attribute is highly significant since it determines the direction of all cash flows. The exact meaning is given with each CT in the ACTUS High Level Specification document.","Applicability":"NN(,,1)"},{"Group":"Contract identification","Name":"LegalEntityIDRecordCreator","Type":"x","List":"some list","Description":"This identifies the legal entity creating the contract record. The counterparty of the contract is tracked in LEICP.\nLEIRC is ideally the official LEI which can be a firm, a government body, even a single person etc. However, this can also refer to a annonymous group in which case this information is not to be disclosed. LEIRC may also refer to a group taking a joint risk.","Applicability":"NN(,,1)"},{"Group":"Contract identification","Name":"ContractID","Type":"x","List":"some list","Description":"Unique identifier of a contract.  \nIf the system is used on a single firm level, an internal unique ID can be generated. If used on a national or globally level, a globally unique ID is required.","Applicability":"NN"},{"Group":"Counterparty","Name":"LegalEntityIDCounterparty","Type":"x","List":"some list","Description":"LEICP identifies the counterparty to the LEIRC in this contract.\nLEICP is ideally the official LEI which can be a firm, a government body, even a single person etc. However, this can also refer to a annonymous group in which case this information is not to be disclosed. LEICP may also refer to a group taking a joint risk or more generally, LEICP is the main counterparty, against which the contract has been settled.","Applicability":"NN(,,2)"},{"Group":"Counterparty","Name":"ContractStatus","Type":"List","List":"some list","Description":"Indicates the current contract performance status. Different states of the contract range from performing to default.","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"Seniority","Type":"List","List":"some list","Description":"Refers to the order of repayment in the event of a sale or default of the issuer. ","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"NonPerformingDate","Type":"x","List":"some list","Description":"The date at which the ContractStatus changed to DF (=Default).","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"PrepaymentPeriod","Type":"x","List":"some list","Description":"If real payment happens before scheduled payment date minus PPP, then it is considered a prepayment. Effect of prepayments are further described in PPEF and related fields.","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"GracePeriod","Type":"x","List":"some list","Description":"If real payment happens after scheduled payment date plus GRP, then the payment is in delay.","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"DelinquencyPeriod","Type":"x","List":"some list","Description":"If real payment happens after scheduled payment date plus DLP, then the counterparty is in technical default. This means that the creditor legally has the right to declare default of the debtor.","Applicability":"x(,,1)"},{"Group":"Counterparty","Name":"DelinquencyRate","Type":"x","List":"some list","Description":"Rate at which Delinquency Payments accrue on NT (in addition to the interest rate) during the DelinquencyPeriod","Applicability":"x(,,1)"},{"Group":"Fees","Name":"CycleAnchorDateOfFee","Type":"x","List":"some list","Description":"Date from which the fee payment date schedule is calculated according to the cycle length. The first fee payment event takes place on this anchor.","Applicability":"x(1,2, )"},{"Group":"Fees","Name":"CycleOfFee","Type":"x","List":"some list","Description":"Defines in combination with FEANX the payment points of fees","Applicability":"x(1,2, )"},{"Group":"Fees","Name":"FeeBasis","Type":"List","List":"some list","Description":"Basis, on which Fee is calculated. For FEB=’A’, FER is interpreted as an absolute amount to be paid at every FP event and for FEB=’N’, FER represents a rate at which FP amounts accrue on the basis of the contract’s NT.","Applicability":"NN(1,1, )"},{"Group":"Fees","Name":"FeeRate","Type":"x","List":"some list","Description":"Rate of Fee which is a percentage of the underlying or FER is an absolute amount. For all contracts where FEB does not apply (cf. business rules), FER is interpreted as an absolute amount.","Applicability":"x(1,0, )"},{"Group":"Fees","Name":"FeeAccrued","Type":"x","List":"some list","Description":"Accrued fees as per SD","Applicability":"x(1,1, )"},{"Group":"Interest","Name":"CycleAnchorDateOfInterestPayment","Type":"x","List":"some list","Description":"Date from which the interest payment date schedule is calculated according to the cycle length. The first interest payment event takes place on this anchor.","Applicability":"x"},{"Group":"Interest","Name":"CycleOfInterestPayment","Type":"x","List":"some list","Description":"Cycle according to which the interest payment date schedule will be calculated.\nIn case IPCL is not set, then there will only be an interest payment event at MD (and possibly at IPANX if set).\nThe interval will be adjusted yet by EOMC and BDC.","Applicability":"x"},{"Group":"Interest","Name":"NominalInterestRate","Type":"x","List":"some list","Description":"The nominal interest rate which will be used to calculate accruals and the next interest payment at the next IP date. NT multiplied with IPNR is the base for the interest payment calculation. The relevant time period is a function of IPDC. \nIf the contract is variable (RRANX set) this field is periodically updated per SD. \nIn the case of plan vanilla interest rate swaps (IRSPV) this defines the rate of fixed leg.","Applicability":"NN"},{"Group":"Interest","Name":"DayCountConvention","Type":"List","List":"some list","Description":"Method defining how days are counted between two dates. This finally defines the year fraction in accrual calculations.","Applicability":"NN"},{"Group":"Interest","Name":"AccruedInterest","Type":"x","List":"some list","Description":"Accrued interest as per SD. In case of NULL, this value will be recalculated using IPANX, IPCL and IPNR information. Can be used to represent irregular next IP payments.","Applicability":"x"},{"Group":"Notional Principal","Name":"Currency","Type":"x","List":"some list","Description":"The currency of the cash flows.","Applicability":"NN"},{"Group":"Notional Principal","Name":"ContractDealDate","Type":"x","List":"some list","Description":"This date signifies the origination of the contract where an agreement between the customer and the bank has been settled. From this date on, the institution will have a (market) risk position for financial contracts. This is even the case when IED is in future.","Applicability":"NN(,,1)"},{"Group":"Notional Principal","Name":"InitialExchangeDate","Type":"x","List":"some list","Description":"Date of the initial cash flow for Maturity and Non-Maturity CT's. It also coincides with the beginning of interest accrual calculation.","Applicability":"NN"},{"Group":"Notional Principal","Name":"MaturityDate","Type":"x","List":"some list","Description":"Marks the contractual end of the lifecycle of a CT. Generally, date of the last cash flows. \nThis includes normally a principal and an interest payment. Some Maturity CTs as perpetuals (PBN) do not have such a date. For variable amortizing contracts of the ANN CT, this date might be less than the scheduled end of the contract (which is deduced from the periodic payment amount \nPRNXT). In this case it balloons.","Applicability":"x"},{"Group":"Notional Principal","Name":"NotionalPrincipal","Type":"x","List":"some list","Description":"Total remaining outstanding principal as per SD. Hence, for amortizing instruments NT will be updated per SD in order to represent current outstanding principal. \nAlthough initial NT will be defined at CDD it will only flow at IED or PRD. The first Cash Flow at IED or PRD is equal to NT+PDIED.\nNT is generally the basis on which interest payments are calculated. If IPCBS is set, IPCBS may introduce a different basis for interest payment calculation.","Applicability":"NN"},{"Group":"Notional Principal","Name":"XDayNotice","Type":"x","List":"some list","Description":"Used as rolling attribute with the callable CT's UMP and CLM uniquely. CLM's and UMP's will not be settled (MD not set) until the client uses his option to call the contract X_Day_Notice after Current Date. As long as MD or TD is not set, the client postpones his right to call to the future. The cycle is normally defined in number of business days.","Applicability":"NN"},{"Group":"Rate Reset","Name":"CycleAnchorDateOfRateReset","Type":"x","List":"some list","Description":"Date from which the rate reset date schedule is calculated according to the cycle length. The first rate reset event takes place on this anchor.","Applicability":"x(9,0,)"},{"Group":"Rate Reset","Name":"CycleOfRateReset","Type":"x","List":"some list","Description":"Cycle according to which the rate reset date schedule will be calculated.\nIn case RRCL is not set, then there will only be one rate reset event at RRANX given RRANX if set.\nThe interval will be adjusted yet by EOMC and BDC.","Applicability":"x(9,0,)"},{"Group":"Rate Reset","Name":"RateSpread","Type":"x","List":"some list","Description":"Interest rate spread. A typical rate resetting rule is LIBOR plus x basis point where x represents the interest rate spread.  \nThe following equation can be taken if RRMLT is not set: IPNR after rate reset = Rate selected from the market object  + RRSP.","Applicability":"NN(9,1,)"},{"Group":"Rate Reset","Name":"MarketObjectCodeOfRateReset","Type":"List","List":"some list","Description":"Is pointing to the interest rate driver (MarketObject) used for rate reset uniquely.\nUnique codes for market objects must be used.","Applicability":"NN(9,1,)"},{"Group":"Rate Reset","Name":"FixingDays","Type":"x","List":"some list","Description":"Interest rate resets (adjustments) are usually fixed one or two days (usually Business Days) before the new rate applies (defined by the rate reset schedule). This field holds the period between fixing and application of a rate.","Applicability":"x(9,1,)"},{"Group":"Rate Reset","Name":"NextResetRate","Type":"x","List":"some list","Description":"Holds the new rate that has been fixed already (cf. attribute FixingDays) but not applied. This new rate will be applied at the next rate reset event (after SD and according to the rate reset schedule). Attention, RRNXT must be set to NULL after it is applied!","Applicability":"x(9,1,)"},{"Group":"Rate Reset","Name":"RateMultiplier","Type":"x","List":"some list","Description":"Interest rate multiplier. A typical rate resetting rule is LIBOR plus x basis point where x represents the interest rate spread.\nHowever, in some cases like reverse or super floater contracts an additional rate multiplier applies. In this case, the new rate is determined as: IPNR after rate reset = Rate selected from the market object * RRMLT + RRSP.","Applicability":"x(9,1,)"}]}
