{
    "Identifier": "form_STK",
    "ContractType": "STK",
    "Name": "Stock",
    "Description": "Any instrument which is bought at a certain amount (market price normally) and then follows an index.",
    "Version": "20190416",
    "Terms": [
  {
    "Group": "Calendar",
    "Name": "Calendar",
    "Type": "Enum",
    "List": "[NoCalendar,MondayToFriday,<wildcard>]",
    "Description": "Calendar defines the non-working days which affect the dates of contract events (CDE's) in combination with EOMC and BDC.",
    "Applicability": "x"
  },
  {
    "Group": "Calendar",
    "Name": "BusinessDayConvention",
    "Type": "Enum",
    "List": "[SCF,SCMF,CSF,CSMF,SCP,SCMP,CSP,CSMP]",
    "Description": "BDC's are linked to a calendar. Calendars have working and non-working days. A BDC value other than N means that cash flows cannot fall on non-working days, they must be shifted to the next business day (following) or the previous on (preceding).nThese two simple rules get refined twofold:n- Following modified (preceding): Same like following (preceding), however if a cash flow gets shifted into a new month, then  it is shifted to preceding (following) business day.n- Shift/calculate (SC) and calculate/shift (CS). Accrual, principal, and possibly other calculations are affected by this choice. In the case of SC first the dates are shifted and after the shift cash flows are calculated. In the case of CS it is the other way round.nAttention: Does not affect non-cyclical dates such as PRD, MD, TD, IPCED since they can be set to the correct date directly.",
    "Applicability": "x"
  },
  {
    "Group": "Calendar",
    "Name": "EndOfMonthConvention",
    "Type": "Enum",
    "List": "[EOM,SD]",
    "Description": "When computing schedules a special problem arises if an anchor date is at the end of a month and a cycle of monthly or quarterly is applied (yearly in the case of leap years only). How do we have to interpret an anchor date April 30 plus 1M cycles? In case where EOM is selected, it will jump to the 31st of May, then June 30, July 31 and so on. If SM is selected, it will jump to the 30st always with of course an exception in February. nThis logic applies for all months having 30 or less days and an anchor date at the last day. Month with 31 days will at any rate jump to the last of the month if anchor date is on the last day.",
    "Applicability": "x"
  },
  {
    "Group": "Contract identification",
    "Name": "ContractType",
    "Type": "Enum",
    "List": "[PAM]",
    "Description": "The ContractType is the most important information. It defines the cash flow generating pattern of a contract. The ContractType information in combination with a given state of the risk factors will produce a deterministic sequence of cash flows which are the basis of any financial analysis.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "StatusDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "SD holds the date per which all attributes of the record were updated. This is especially important for the highly dynamic attributes like Accruals, Notional, interest rates in variable instruments etc.",
    "Applicability": "NN(,,1)"
  },
  {
    "Group": "Contract identification",
    "Name": "ContractRole",
    "Type": "Enum",
    "List": "[RPA,RPL,LG,ST,RFL,PFL,BUY,SEL,GUA,OBL]",
    "Description": "CNTRL defines which position the LEIRC ( the creator of the contract record ) takes in a contract. For example, whether the contract is an asset or liability, a long or short position for the LEIRC. nMost contracts are simple on or off balance sheet positions which are assets, liabilities. Such contracts can also play a secondary role as a collateral. nThe attribute is highly significant since it determines the direction of all cash flows. The exact meaning is given with each CT in the ACTUS High Level Specification document.",
    "Applicability": "NN(,,1)"
  },
  {
    "Group": "Contract identification",
    "Name": "LegalEntityIDRecordCreator",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "This identifies the legal entity creating the contract record. The counterparty of the contract is tracked in LEICP.nLEIRC is ideally the official LEI which can be a firm, a government body, even a single person etc. However, this can also refer to a annonymous group in which case this information is not to be disclosed. LEIRC may also refer to a group taking a joint risk.",
    "Applicability": "NN(,,1)"
  },
  {
    "Group": "Contract identification",
    "Name": "ContractID",
    "Type": "Integer",
    "List": "[NA]",
    "Description": "Unique identifier of a contract.  nIf the system is used on a single firm level, an internal unique ID can be generated. If used on a national or globally level, a globally unique ID is required.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "MarketObjectCode",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "Is pointing to the market value at SD (MarketObject).nUnique codes for market objects must be used.",
    "Applicability": "x"
  },
  {
    "Group": "Counterparty",
    "Name": "LegalEntityIDCounterparty",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "LEICP identifies the counterparty to the LEIRC in this contract.nLEICP is ideally the official LEI which can be a firm, a government body, even a single person etc. However, this can also refer to a annonymous group in which case this information is not to be disclosed. LEICP may also refer to a group taking a joint risk or more generally, LEICP is the main counterparty, against which the contract has been settled.",
    "Applicability": "NN(,,2)"
  },
  {
    "Group": "Counterparty",
    "Name": "ContractStatus",
    "Type": "Enum",
    "List": "[PF,DL,DQ,DF]",
    "Description": "Indicates the current contract performance status. Different states of the contract range from performing to default.",
    "Applicability": "x(,,1)"
  },
  {
    "Group": "Counterparty",
    "Name": "Seniority",
    "Type": "Enum",
    "List": "[S,J]",
    "Description": "Refers to the order of repayment in the event of a sale or default of the issuer. ",
    "Applicability": "x(,,1)"
  },
  {
    "Group": "Counterparty",
    "Name": "NonPerformingDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "The date at which the ContractStatus changed to DF (=Default).",
    "Applicability": "x(,,1)"
  },
  {
    "Group": "Dividend",
    "Name": "CycleAnchorDateOfDividend",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "Date from which the dividend payment date schedule is calculated according to the cycle length. The first dividend payment event takes place on this anchor.",
    "Applicability": "NN(1,1,)"
  },
  {
    "Group": "Dividend",
    "Name": "CycleOfDividend",
    "Type": "Period",
    "List": "[NA]",
    "Description": "Defines in combination with DVANX the payment points of dividends. The dividend payment schedule will start at DVANX and end at MaximumProjectionPeriod (cf. sheet Modeling Parameters).",
    "Applicability": "x(1,0,)"
  },
  {
    "Group": "Dividend",
    "Name": "NextDividendPaymentAmount",
    "Type": "Real",
    "List": "[(0, Positive)]",
    "Description": "Defines the next dividend payment (amount) whereas the date of dividend payment is defined through the DVANX/DVCL pair. If DVCL is defined, then this amount will be used as dividend payment for each future dividend payment date.",
    "Applicability": "x(1,0,)"
  },
  {
    "Group": "Dividend",
    "Name": "ExDividendDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "In case contract is traded between DVEX and next DV payment date (i.e. PRD>DVEX & PRD<next DV payment date), then the old “holder” of the contract (previous to the trade) receives the next DV payment. In other words, the next DV payment is “cancelled” for the new (after the trade) holder of the contract.",
    "Applicability": "x(1,1,)"
  },
  {
    "Group": "Notional Principal",
    "Name": "Currency",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "The currency of the cash flows.",
    "Applicability": "NN"
  },
  {
    "Group": "Notional Principal",
    "Name": "ContractDealDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "This date signifies the origination of the contract where an agreement between the customer and the bank has been settled. From this date on, the institution will have a (market) risk position for financial contracts. This is even the case when IED is in future.",
    "Applicability": "NN(,,1)"
  },
  {
    "Group": "Notional Principal",
    "Name": "Quantity",
    "Type": "Real",
    "List": "[Positive]",
    "Description": "This attribute relates either to physical contracts (COM) or underlyings of traded contracts. nIn case of physical contracts it holds the number of underlying units of the specific good (e.g. number of barrels of oil). nIn case of well defined traded contracts it holds the number of defined underlying instruments. Example: QT of STK CTs underlying a FUTUR indicates the number of those specific STK CTs which underlie the FUTUR.",
    "Applicability": "NN(,,3)"
  },
  {
    "Group": "Notional Principal",
    "Name": "PurchaseDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "If a contract is bought after initiation (for example a bond on the secondary market) this date has to be set. It refers to the date at which the payment (of PPRD) and transfer of the security happens. In other words, PRD - if set - takes the role otherwise IED has from a cash flow perspective. nNote, LEICP of the CT is not the counterparty of the transaction!",
    "Applicability": "NN"
  },
  {
    "Group": "Notional Principal",
    "Name": "PriceAtPurchaseDate",
    "Type": "Real",
    "List": "[NA]",
    "Description": "Purchase price exchanged at PRD.  nPPRD represents a “clean” price (includes premium/discount but not IPAC).",
    "Applicability": "NN"
  },
  {
    "Group": "Notional Principal",
    "Name": "TerminationDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "If a contract is sold before MD (for example a bond on the secondary market) this date has to be set. It refers to the date at which the payment (of PTD) and transfer of the security happens. In other words, TD - if set - takes the role otherwise MD has from a cash flow perspective. nNote, LEICP of the CT is not the counterparty of the transaction!",
    "Applicability": "x(6,0,1)"
  },
  {
    "Group": "Notional Principal",
    "Name": "PriceAtTerminationDate",
    "Type": "Real",
    "List": "[NA]",
    "Description": "Sellingprice exchanged at PTD  PTDrepresents a “clean” price (includes premium/discount but not IPAC",
    "Applicability": "NN(6,1,1)"
  },
  {
    "Group": "Notional Principal",
    "Name": "MarketValueObserved",
    "Type": "Real",
    "List": "[NA]",
    "Description": "Value as observed in the market at SD per unit. Incase of fixed income instruments it is a fraction.",
    "Applicability": "x"
  }
]
  }
