{
    "Identifier": "form_CSH",
    "ContractType": "CSH",
    "Name": "Cash",
    "Description": "Cash or cash equivalent position",
    "Version": "20190416",
    "Terms": [
  {
    "Group": "Contract identification",
    "Name": "ContractType",
    "Type": "Enum",
    "List": "[PAM]",
    "Description": "The ContractType is the most important information. It defines the cash flow generating pattern of a contract. The ContractType information in combination with a given state of the risk factors will produce a deterministic sequence of cash flows which are the basis of any financial analysis.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "StatusDate",
    "Type": "Timestamp",
    "List": "[ISO8601 Datetime]",
    "Description": "SD holds the date per which all attributes of the record were updated. This is especially important for the highly dynamic attributes like Accruals, Notional, interest rates in variable instruments etc.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "ContractRole",
    "Type": "Enum",
    "List": "[RPA,RPL,LG,ST,RFL,PFL,BUY,SEL,GUA,OBL]",
    "Description": "CNTRL defines which position the LEIRC ( the creator of the contract record ) takes in a contract. For example, whether the contract is an asset or liability, a long or short position for the LEIRC. nMost contracts are simple on or off balance sheet positions which are assets, liabilities. Such contracts can also play a secondary role as a collateral. nThe attribute is highly significant since it determines the direction of all cash flows. The exact meaning is given with each CT in the ACTUS High Level Specification document.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "LegalEntityIDRecordCreator",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "This identifies the legal entity creating the contract record. The counterparty of the contract is tracked in LEICP.nLEIRC is ideally the official LEI which can be a firm, a government body, even a single person etc. However, this can also refer to a annonymous group in which case this information is not to be disclosed. LEIRC may also refer to a group taking a joint risk.",
    "Applicability": "NN"
  },
  {
    "Group": "Contract identification",
    "Name": "ContractID",
    "Type": "Integer",
    "List": "[NA]",
    "Description": "Unique identifier of a contract.  nIf the system is used on a single firm level, an internal unique ID can be generated. If used on a national or globally level, a globally unique ID is required.",
    "Applicability": "NN"
  },
  {
    "Group": "Notional Principal",
    "Name": "Currency",
    "Type": "Varchar",
    "List": "[NA]",
    "Description": "The currency of the cash flows.",
    "Applicability": "NN"
  },
  {
    "Group": "Notional Principal",
    "Name": "NotionalPrincipal",
    "Type": "Real",
    "List": "[0, positive, 2 decimals]",
    "Description": "Total remaining outstanding principal as per SD. Hence, for amortizing instruments NT will be updated per SD in order to represent current outstanding principal. nAlthough initial NT will be defined at CDD it will only flow at IED or PRD. The first Cash Flow at IED or PRD is equal to NT+PDIED.nNT is generally the basis on which interest payments are calculated. If IPCBS is set, IPCBS may introduce a different basis for interest payment calculation.",
    "Applicability": "NN"
  }
]
  }
